---
kind: property
id: P:Autodesk.Revit.DB.Structure.AreaReinforcement.AdditionalTopCoverOffset
source: html/f48b73e5-5690-0a18-ee73-fc2d63ab201f.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcement.AdditionalTopCoverOffset Property

Additional offset from the top or exterior cover reference.

## Syntax (C#)
```csharp
public double AdditionalTopCoverOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for additionalTopCoverOffset must be no more than 30000 feet in absolute value.